In [5]:
import pandas as pd

# 시리즈

In [7]:
d = {
    '1차성적':86,
    '2차성적':85,
    '3차성적':89,
    '4차성적':95,
}
ser1 = pd.Series(d)
ser1

1차성적    86
2차성적    85
3차성적    89
4차성적    95
dtype: int64

In [8]:
d2={
    'id0001':'홍길동',
    'id0002':'이순신',
    'id0003':'강감찬',
    'id0004':'임꺽정',
}
ser2 = pd.Series(d2)
ser2

id0001    홍길동
id0002    이순신
id0003    강감찬
id0004    임꺽정
dtype: object

## 리스트로 시리즈 생성

## Dict(딕셔너리)로 시리즈 생성

* 키가 시리즈의 인덱스로 활용이 된다.

# 데이터 프레임

## 시리즈로 데이터 프레임 생성 1 - Dict의 키가 index로 활용

In [13]:
df = pd.DataFrame(ser2,columns=['이름'])
df

         이름
id0001  홍길동
id0002  이순신
id0003  강감찬
id0004  임꺽정

## 시리즈로 데이터 프레임 생성 2  - dict의 키가 컬럼으로 활용

In [14]:
s1 = pd.Series([91,92,93,94], name='s1')
s2 = pd.Series([81,82,83,84], name='s2')

In [17]:
df =pd.DataFrame(
    {
        #딕셔너리의 키가 데이터 프레임의 열 이름으로 활용
        #딕셔너리 키의 값이 데이터 프레임 열의 실데이터로 활용ㅊㅍ
        '국어점수':s1, 
        '수학점수':s2
    }
)
df

   국어점수  수학점수
0    91    81
1    92    82
2    93    83
3    94    84

In [17]:
df =pd.DataFrame(
    {
        #딕셔너리의 키가 데이터 프레임의 열 이름으로 활용
        #딕셔너리 키의 값이 데이터 프레임 열의 실데이터로 활용ㅊㅍ
        '국어점수':[91,92,93,94]
        '수학점수':[81,82,83,84]
        
    }
)
df

   국어점수  수학점수
0    91    81
1    92    82
2    93    83
3    94    84

In [21]:
df =pd.DataFrame(
    [
        [91,81],
        [92,82],
        [93,83],
        [94,84]
    ], columns=['국어점수','수학점수']
)
df

   국어점수  수학점수
0    91    81
1    92    82
2    93    83
3    94    84